# SizeString Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartSizeMap..::..SizeString Property
FabricationPartSizeMap Class See Also
---
The size display string for the straight that can be used by the user interface.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public string SizeString { get; set; }
```

Visual Basic
---
```text
Public Property SizeString As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SizeString {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace